{
	"@comment": "Note that the code to transform these data into a webpage is in https://github.com/Schnark/schnark.github.io",
	"title": {
		"en": "Racer – App for Firefox OS",
		"de": "Racer – App für Firefox OS"
	},
	"serviceworker": false,
	"icon": "i.png",
	"screenshots": [
		"main.png#landscape",
		"red.png#landscape",
		"blue.png#landscape",
		"yellow.png#landscape",
		"green.png#landscape"
	],
	"desc": {
		"en": ["This is a simple racer game. The most remarkable thing about it is it's size: The Firefox OS app is less than 10kB, so it'll be one of the most smallest apps you have installed, if not the smallest at all. It actually consists of just three files: The icon (around 1kB), the manifest (a tiny file), and the actual app (actually two files with more than 45kB, minified to about 20kB, and compressed to about 8kB). After installing, some additional data is stored, but the size is still below 10kB.", "The code is based on <a href='https://github.com/jakesgordon/javascript-racer' target='_blank'>javascript-racer</a> by Jake Gordon, but also inspired to some degree by <a href='https://github.com/halfnelson/js13k2015' target='_blank'>js13k2015</a> and <a href='https://github.com/onaluf/RacerJS' target='_blank'>RacerJS</a>.", "To play, just select the style, your car and the road. On desktop, use the arrow keys to steer and to accelerate/brake, on mobile turn your phone like a steering wheel and tap the screen on the right to accelerate, on the left to brake. There was no space left to control the sound (neither on the screen nor in the code), so you have to silence your device if you don't want to hear it."],
		"de": ["Dieses Spiel ist ein einfaches Autorennen. Das Bemerkenswerte daran ist die Größe: Die Firefox-OS-App ist kleiner als 10kB, sodass sie eine deiner kleinsten Apps sein wird, die du installiert hast, wenn nicht die kleinste überhaupt. Sie besteht tatsächlich nur aus drei Dateien: Das Icon (etwa 1kB), das Manifest (eine winzige Datei) und die eigentliche App (eigentlich zwei Dateien mit über 45kB, minimiert zu etwa 20kB und komprimiert zu etwa 8kB). Nach der Installation werden noch einige zusätzliche Daten gespeichert, aber die Größe bleibt unter 10kB.", "Der Code basiert auf <a href='https://github.com/jakesgordon/javascript-racer' target='_blank'>javascript-racer</a> von Jake Gordon, ist aber auch zu Teilen inspiriert von <a href='https://github.com/halfnelson/js13k2015' target='_blank'>js13k2015</a> und <a href='https://github.com/onaluf/RacerJS' target='_blank'>RacerJS</a>.", "Zum Spielen wählst du einfach den Stil, dein Auto und die Straße aus. Auf dem Desktop nutzt du die Pfeiltasten zum Lenken und Beschleunigen/Bremsen, in der Mobilversion drehst du dein Smartphone wie ein Lenkrad und berührst den Bildschirm rechts zum Beschleunigen, links zum Bremsen. Es gab keinen Platz mehr für Einstellungen zum Ton (weder auf dem Bildschirm noch im Code), daher musst du dein Gerät stummschalten, falls du ihn nicht hören willst."]
	}
}